{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "same", "trainable": true, "activity_regularizer": null, "input_dtype": "float32", "bias": true, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "nb_row": 5, "nb_filter": 32, "b_regularizer": null, "subsample": [2, 2], "batch_input_shape": [null, 64, 64, 3], "W_constraint": null, "name": "layer1", "activation": "linear", "nb_col": 5, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 16, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "name": "layer2", "activation": "linear", "nb_col": 3, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "trainable": true, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_constraint": null, "init": "glorot_uniform", "nb_row": 3, "nb_filter": 16, "b_regularizer": null, "subsample": [1, 1], "W_constraint": null, "name": "layer3", "activation": "linear", "nb_col": 3, "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 1024, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "activation": "linear", "name": "layer4", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.3}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 512, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "activation": "linear", "name": "layer5", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias": true, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null, "input_dim": null, "activation": "linear", "name": "layer6", "W_regularizer": null}}], "keras_version": "1.1.2"}